      *>****************************************************************
      *> WONLINE.cpy  -  オンライン CGI 共通ワーク
      *>****************************************************************
       01  RESP-PTR    PIC 9(9) COMP VALUE 1.
       01  NUM-STR     PIC X(13) VALUE SPACES.
       01  WK-ERRMSG   PIC X(256) VALUE SPACES.
